dynamic-scope-in-racket.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-03-04 Sat 00:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Dynamic Scope In Racket</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="How to use dynamic scope in Racket"
>
<meta name="keywords" content="racket, scope, dynamic, static">

<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./dynamic-scope-in-racket.html"> Dynamic Scope In Racket</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( March 10, 2016)</span></span></h3>
</p>

<p>
One way to do dynamic scope is with <a href="https://www.gnu.org/software/mit-scheme/documentation/mit-scheme-ref/Dynamic-Binding.html">fluid-let</a>, which basically reassigns the
value of a variable instead of creating a shadow, but though this is available
in Scheme, it&rsquo;s not available in Racket.
</p>

<p>
Racket has a form named <a href="https://docs.racket-lang.org/guide/parameterize.html">parameterize</a>, that allows you to pass variables
dynamically, but forces you to set a default value.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-function-name">x</span> <span class="org-rainbow-delimiters-depth-2">(</span>make-parameter 2<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">incr-x</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">(</span>+ <span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span> 1<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">dynamic-x</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">parameterize</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>x 5<span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>incr-x<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
<code>make-parameter</code> creates a function <code>x</code> that returns the value. Evaluating <code>(x)</code>
results in <code>2</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>incr-x<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-comment-delimiter">;</span><span class="org-comment">=&gt; 3</span>
</pre>
</div>

<p>
However, you can associate a new value to the <code>x</code> parameter using <code>parameterize</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>dynamic-x<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-comment-delimiter">;</span><span class="org-comment">=&gt; 6</span>
</pre>
</div>

<p>
An advantage of <code>parameterize</code> over imperative updates of parameter values is
that the implementation is thread-safe, and continuation-friendly. There are a
few other pluses in addition to that, which you can check out in the docs.
</p>

<p>
</div>
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
